{
  "experienceContent": [
    {
      "year": "APRIL 2023 - JUNE 2023",
      "position": "SENIOR REACT DEV",
      "compnayName": "KUORUM",
      "companyDescription": "Kuorum is a Secure Online Voting start-up located in Madrid, Spain",
      "tech_stack": "Tailwind, Typescript, React, React-redux, Use React, Prime React, Git, Agile Methodologies, AWS, Jest (testing)",
      "details": [
        "Improved the quality of React, TypeScript, and CSS (SASS) by conducting code analysis.",
        "Successfully delivered projects on time, following Agile Methodologies.",
        "Developed efficient and reusable code with React.",
        "Enabled accurate project tracking and reporting in GitHub and Jira.",
        "Enhanced website navigation with clear user experience (UX) mapping.",
        "Facilitated code reviews and pair programming sessions to ensure production of high quality code.",
        "Collaborated with web designers to align with intended visual design."
      ]
    },
    {
      "year": "FEB 2022 - DEC 2022",
      "position": "SENIOR REACT DEV",
      "compnayName": "GFT GROUP - DBS BANK",
      "companyDescription": "DBS is the largest east side bank, located in Singapur. We were doing a new application in React Ecosystem in order to replace this current APP https://internet-banking.dbs.com.sg/IB/Welcome, for the final customers. It allows final users to access their bank account, make transactions, update their information number, check their records, and all that a Bank APP allows to do. ",
      "tech_stack": "React, Typescript, Redux, Redux Saga, Redux Thunk, Unit testing, Confluence, Git, Jenkins, Agile, Kanban",
      "details": [
        "Developed efficient and reusable code libraries.",
        "Managed software lifecycle from concept to execution.",
        "Wrote clean and well-tested code for various Micro Front Ends.",
        "Implemented system testing and validation guidelines.",
        "Generated reports on programming project specifications, activities, and developments.",
        "Verified and resolved bug reports and issues.",
        "Trained teams to develop skills using React library and hooks.",
        "Optimised frontend performance through clean coding practices.",
        "Facilitated code reviews and pair programming sessions to ensure production of high quality code."
      ]
    },
    {
      "year": "JULY 2019 - FEB 2022",
      "position": "SENIOR REACT DEV",
      "compnayName": "GREEN POWER MONITOR",
      "tech_stack": "React, Typescript,Jest, Unit testing, Confluence, Git, Azure Devops Tools, Agile, Kanban, Lodash",
      "companyDescription": "Green Power Monitor is part of the DNVGL group which is focused on renewable energy monitoring.",
      "details": [
        "Performed manual and automated testing to ensure stability of React Libraries, achieving a test coverage of 75%.",
        "Collaborated with UX designers and Product Owners to create cohesive products with Agile Methodologies.",
        "Wrote clean, well-tested code for React using Ant Design.",
        "Improved quality of React and CSS by conducting code analysis and recommending changes to policies and procedures.",
        "Updated custom libraries to different React versions, ensuring compatibility with TypeScript and dependencies.",
        "Verified and resolved bug reports and issues.",
        "Developed algorithms and flowcharts to create new software and systems.",
        "Facilitated code reviews and pair programming sessions to foster the creation of high-quality code."
      ]
    },
    {
      "year": "JULY 2017 - JULY 2019",
      "position": "SENIOR WEB DEV",
      "compnayName": "TAPPX",
      "companyDescription": "Tappx is a company focused on displaying advertisements in mobile apps. ",
      "tech_stack": "React, Redux, Confluence, Git, Jenkins, PHP, Laravel, Tableau API, Vue.js, JQuery",
      "details": [
        "Optimized user experience by ensuring development of well-structured frontend and backend code.",
        "Actively drove continuous improvement by staying up to date with latest changes in software development.",
        "Created databases, data entry systems, and web forms.",
        "Developed websites with HTML, CSS, PHP and JavaScript skills.",
        "Collaborated with web designers to align with intended visual design.",
        "Developed and tested REST APIs, ensuring effective response to wide variety of requests."
      ]
    },
    {
      "year": "FEB 2016 - JULY 2017",
      "position": "FULL STACK DEV",
      "compnayName": "NÜK STUDIO",
      "companyDescription": "Nük Studios is a design company focused on design campaigns, online marketing, and web and mobile development.s ",
      "tech_stack": "PHP, Laravel, JQuery, Wordpress, Bootstrap, HTML, Git, Lodash, Foundation",
      "details": [
        "Managed databases using SQL skills.",
        "Developed frontend and backend for mobile and web applications.",
        "Created websites with HTML, CSS, PHP and JavaScript skills.",
        "Applied SEO techniques to improve Google rankings and engagement."
      ]
    },
    {
      "year": "DEC 2011 - JANUARY 2015",
      "position": "FULL STACK DEV",
      "compnayName": "ALFIL STUDIO",
      "companyDescription": "Alfil was an advertisement agency focused in development of custom websites, marketing campaigns and custom developments",
      "tech_stack": "PHP, Codeigniter, Dingo (php library), Wordpress, Bootstrap, HTML, Git, Lodash, css",
      "details": [
        "Built site specific interfaces for navigation, data management, and e-commerce requirements.",
        "Collaborated with clients and designers to develop robust and functional platforms. Created custom websites by leveraging HTML, CSS, PHP and JavaScript skills.",
        "Delivered front-end and back-end development for web applications."
      ]
    }
  ]
}